// ####################
// แบบฝึกหัด 1
// ####################

<?php
    $a = 1; 
    $b = 2; 
    $c = $a + $b; 

    echo $a; // แสดงผล : 
    echo $b; // แสดงผล : 
    echo $c; // แสดงผล : 
?>


// ####################
// แบบฝึกหัด 2
// ####################

<?php
    $a = 1578764; 
    $b = 22; 
    $b = $b;
    $a = $b + 22; 

    echo $a; // แสดงผล :  
    echo $b; // แสดงผล : 
?>

// ####################
// แบบฝึกหัด 3
// ####################

<?php
    $a = 11; 
    $b = 22; 
    $c = 33;
    $a = $b + $c;
    $b = $a + $a;
    $a = $b + $c;
    $c = $a + $b;

    echo $a; // แสดงผล : 
    echo $b; // แสดงผล : 
    echo $c; // แสดงผล : 
?>


// ####################
// แบบฝึกหัด 4
// ####################

<?php
    $a = "hi"; 
    $b = "hello"; 
    $c = "goodbye";
    $d = "goodnight";

    $d = $a; 
    $a = $b; 
    $b = $c; 
    $c = $d; 

    echo $a; // แสดงผล : 
    echo $b; // แสดงผล : 
    echo $c; // แสดงผล : 
    echo $d; // แสดงผล : 
?>


// ####################
// แบบฝึกหัด 5 
// ####################

<?php
    $name = "_My name is_";
    $lastname = "_Natcha_";

    echo $name . $lastname; // แสดงผล : KiKiKoko
?>



// ####################
// แบบฝึกหัด 6 
// ####################

<?php
    $name = "Bob";
    $lastname = "Marley";

    echo "สวัสดีทุกคน, ชื่อของฉันคือ " . $name . " " . $lastname; // แสดงผล : "สวัสดีทุกคน.ชื่อของฉันคือ.Bob.Marlay"
?>




// ####################
// แบบฝึกหัด 7 
// ####################

<?php
    class Cat {
        public $name = "Garfield";
        public $breed = "Scottish";

        public function meow() {
            echo $this->name . " แมวพันธุ์ " . $this->breed . " เพิ่งร้องเมี๊ยว!";
        }
    }

    $myCat = new Cat();
    echo $myCat->name; // แสดงผล: Garfield

    $myCat->meow(); // แสดงผล: Scottish
?>