// ####################
// แบบฝึกหัด 1
// ####################

<?php
    $a = 1; 
    $b = 2; 
    $c = $a + $b;

    echo $a; // แสดงผล :1 
    echo $b; // แสดงผล :2
    echo $c; // แสดงผล :3
?>


// ####################
// แบบฝึกหัด 2
// ####################

<?php
    $a = 1578764; 
    $b = 22; 
    $b = $b; 
    $a = $b + 22;

    echo $a; // แสดงผล : 44
    echo $b; // แสดงผล : 22
?>

// ####################
// แบบฝึกหัด 3
// ####################

<?php
    $a = 11; 
    $b = 22; 
    $c = 33;
    $a = $b + $c;55
    $b = $a + $a;110
    $a = $b + $c;143
    $c = $a + $b;253

    echo $a; // แสดงผล : 143
    echo $b; // แสดงผล : 110
    echo $c; // แสดงผล : 253
?>


// ####################
// แบบฝึกหัด 4
// ####################

<?php
    $a = "สวัสดี"; 
    $b = "ลาก่อน"; 
    $c = "แล้วพบกันใหม่";
    $d = "ราตรีสวัสดิ์";

    $d = $a;sawatdee
    $a = $b;lagon
    $b = $c;seeyouagen
    $c = $d;goodnigh

    echo $a; // แสดงผล : 
    echo $b; // แสดงผล : 
    echo $c; // แสดงผล : 
    echo $d; // แสดงผล : 
?>


// ####################
// แบบฝึกหัด 5 (ไม่บังคับ)
// ####################

<?php
    $name = "Kiki";
    $lastname = "Koko";

    echo $name . $lastname; // แสดงผล : 
?>



// ####################
// แบบฝึกหัด 6 (ไม่บังคับ)
// ####################

<?php
    $name = "Bob";
    $lastname = "Marley";

    echo "สวัสดีทุกคน, ชื่อของฉันคือ " . $name . " " . $lastname; // แสดงผล : 
?>




// ####################
// แบบฝึกหัด 7 (ไม่บังคับ)
// ####################

<?php
    class Cat {
        public $name = "Garfield";
        public $breed = "Scottish";

        public function meow() {
            echo $this->name . " แมวพันธุ์ " . $this->breed . " เพิ่งร้องเมี๊ยว!";
        }
    }

    $myCat = new Cat();
    echo $myCat->name; // แสดงผล: 

    $myCat->meow(); // แสดงผล: 
?>